tutorials/rigidBodyAndBeam_beamFoamCoupled/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    "(left|right|front|back|bottom|top)"
    {
        type  pressureInletOutletVelocity;
        value uniform (0 0 0);
    }

    floatingObject
    {
        type  movingWallVelocity;
        slip  yes;
        value uniform (0 0 0);
    }
}

// ************************************************************************* //
