tutorials/rigidBodyAndBeam_beamFoamCoupled/0/beam/CMQW
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       surfaceTensorField;
    location    "2";
    object      CMQW;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 2 -2 0 0 0 0];

oriented        oriented;

internalField   nonuniform List<tensor> 
59
(
(-6.39287e-26 0.000139104 1.20676e-20 -0.000139104 1.79512e-27 -3.33826 -1.36022e-20 3.33826 6.21332e-26)
(-5.6608e-26 0.000133745 -6.27073e-21 -0.000133745 -1.27582e-25 -3.33826 4.85806e-21 3.33826 1.84191e-25)
(-5.41536e-26 0.000129305 4.64586e-21 -0.000129305 1.23383e-25 -3.33826 -6.0441e-21 3.33826 -6.92307e-26)
(-5.9608e-26 0.000124315 -1.90972e-21 -0.000124315 3.48229e-26 -3.33826 3.09168e-22 3.33826 2.47858e-26)
(-5.12462e-26 0.000119653 1.59655e-21 -0.000119653 -7.18888e-26 -3.33826 -3.02635e-21 3.33826 1.23137e-25)
(-5.34838e-26 0.000114795 -4.42942e-22 -0.000114795 -6.77629e-26 -3.33826 -1.11233e-21 3.33826 1.21247e-25)
(-4.14681e-26 0.000110055 4.46336e-22 -0.000110055 2.8922e-25 -3.33826 -1.70419e-21 3.33826 -2.47754e-25)
(-5.19747e-26 0.000105245 -2.97065e-22 -0.000105245 6.51175e-26 -3.33826 -1.35151e-21 3.33826 -1.31445e-26)
...
)
;

boundaryField
{
    left
    {
        type            calculated;
        value           uniform (6.63966e-26 -0.000142928 1.91579e-20 0.000142928 1.36606e-26 3.33826 -1.76081e-20 -3.33826 -8.00577e-26);
    }
    right
    {
        type            calculated;
        value           uniform (-1.44238e-26 -0.000142944 1.85753e-20 0.000142944 -1.4372e-26 -3.33863 -1.82389e-20 3.33863 2.87977e-26);
    }
    beam
    {
        type            empty;
        value           nonuniform List<tensor> 0();
    }
}


// ************************************************************************* //
