tutorials/rigidBodyAndBeam_beamFoamCoupled/0/beam/Lambdaf
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       surfaceTensorField;
    location    "2";
    object      Lambdaf;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<tensor> 
59
(
(1 2.32263e-19 4.16698e-05 3.15519e-21 1 -5.65937e-15 -4.16698e-05 5.65937e-15 1)
(1 2.28667e-19 4.00644e-05 -2.30165e-21 1 -5.65939e-15 -4.00644e-05 5.65939e-15 1)
(1 2.17869e-19 3.87343e-05 9.72822e-22 1 -5.65939e-15 -3.87343e-05 5.65939e-15 1)
(1 2.1138e-19 3.72395e-05 -1.05156e-21 1 -5.65939e-15 -3.72395e-05 5.65939e-15 1)
(1 2.02421e-19 3.58432e-05 4.99255e-23 1 -5.65938e-15 -3.58432e-05 5.65938e-15 1)
(1 1.948e-19 3.43879e-05 -5.98605e-22 1 -5.65938e-15 -3.43879e-05 5.65938e-15 1)
(1 1.86487e-19 3.2968e-05 -2.43122e-22 1 -5.65937e-15 -3.2968e-05 5.65937e-15 1)
(1 1.78568e-19 3.15269e-05 -5.82855e-22 1 -5.65937e-15 -3.15269e-05 5.65937e-15 1)
...
)
;

boundaryField
{
    left
    {
        type            calculated;
        value           uniform (1 2.48098e-19 4.28152e-05 -6.20318e-21 1 -5.65935e-15 -4.28152e-05 5.65935e-15 1);
    }
    right
    {
        type            calculated;
        value           uniform (1 -2.47882e-19 -4.28152e-05 5.66457e-21 1 -5.65935e-15 4.28152e-05 5.65935e-15 1);
    }
    beam
    {
        type            empty;
        value           nonuniform List<tensor> 0();
    }
}


// ************************************************************************* //
