tutorials/rigidBodyAndBeam_beamFoamCoupled/0/beam/explicitQ
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       surfaceVectorField;
    location    "2";
    object      explicitQ;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 1 -2 0 0 0 0];

oriented        oriented;

internalField   nonuniform List<vector> 
59
(
(19.4988 1.92324e-23 -0.000810409)
(19.4988 1.92323e-23 -0.000782464)
(19.4988 1.92312e-23 -0.000754519)
(19.4988 1.92312e-23 -0.000726573)
(19.4988 1.92278e-23 -0.000698628)
(19.4988 1.92293e-23 -0.000670683)
(19.4988 1.92207e-23 -0.000642738)
(19.4988 1.92292e-23 -0.000614793)
...
)
;

boundaryField
{
    left
    {
        type            calculated;
        value           uniform (-19.4988 -6.81181e-12 0.000838354);
    }
    right
    {
        type            calculated;
        value           uniform (19.4988 -6.81104e-12 0.000838354);
    }
    beam
    {
        type            empty;
        value           nonuniform List<vector> 0();
    }
}


// ************************************************************************* //
